use G_MyBase;

--1
go
create view [Список деталей]
as select 
ДЕТАЛИ.ID_детали [код],
ДЕТАЛИ.Название_детали [название детали], 
ДЕТАЛИ.Артикул [артикул],
ДЕТАЛИ.Цена [цена]
from ДЕТАЛИ;
go
select * from [Список деталей]

drop view [Список деталей]

--2
go
create view [Количество деталей]
as select 
p.Код_поставщика [поставщик], COUNT(d.Название_детали)[количество деталей]
from ПОСТАВЩИКИ p inner join ДЕТАЛИ d
on p.Код_поставщика=d.Код_поставщика
group by p.Код_поставщика
go
select * from [Количество деталей] order by [количество деталей]
go 
drop view [Количество деталей]

--3
go
create view [Список двигателей]
	as select 
	ДЕТАЛИ.ID_детали [код],
	ДЕТАЛИ.Название_детали [название детали], 
	ДЕТАЛИ.Цена [цена]
	from ДЕТАЛИ
	where Название_детали like '%двигатель%'
go
select * from [Список двигателей]
go
alter view [Список двигателей]
	as select 
	ДЕТАЛИ.ID_детали [код],
	ДЕТАЛИ.Название_детали [название детали], 
	ДЕТАЛИ.Цена [цена],
	ДЕТАЛИ.Артикул[артикул]
	from ДЕТАЛИ
	where Название_детали like '%двигатель%';
select * from [Список двигателей]

insert [Список двигателей] values ('23','Двигатель в2',222)
select * from [Список двигателей]

update [Список двигателей]
set [цена]=0
where ([цена]=222)
select * from [Список двигателей]

delete [Список двигателей]
where [код]=23
select * from [Список двигателей]

drop view [Список двигателей]

--4
create view [Список двигателей]
	as select 
	ДЕТАЛИ.ID_детали[код],
	ДЕТАЛИ.Название_детали [название детали], 
	ДЕТАЛИ.Цена [цена]
	from ДЕТАЛИ
	where Название_детали like '%двигатель%' with check option
go
select * from [Список двигателей]

insert [Список двигателей] values ('26','двигатель ф1',200);
--insert [Список двигателей] values ('27','ф1',200);

select * from [Список двигателей]
drop view [Список двигателей]

--5
create view [детали по алф]
as select top 15
ДЕТАЛИ.ID_детали [код],
ДЕТАЛИ.Название_детали [название детали], 
ДЕТАЛИ.Артикул [артикул],
ДЕТАЛИ.Цена [цена]
from ДЕТАЛИ
order by [название детали]
go
select * from [детали по алф]

drop view [детали по алф]

--6
go
create view [Количество деталей]
as select 
p.Код_поставщика [поставщик], COUNT(d.Название_детали)[количество деталей]
from ПОСТАВЩИКИ p inner join ДЕТАЛИ d
on p.Код_поставщика=d.Код_поставщика
group by p.Код_поставщика
go 

alter view [Количество деталей] with schemabinding
as select 
p.Код_поставщика [поставщик], 
COUNT(d.Название_детали)[количество деталей],
d.Количество_на_складе[количество на складе]
from dbo.ПОСТАВЩИКИ p inner join dbo.ДЕТАЛИ d
on p.Код_поставщика=d.Код_поставщика
group by p.Код_поставщика, d.Количество_на_складе
go
select * from [Количество деталей]

drop view [Количество деталей]