use	G_MyBase

INSERT into ПОСТАВЩИКИ(Код_поставщика,Название, Адрес, Телефон)
	values	(111, 'ФырФыр', 'Минск','+375292022356'),
			(222, 'Гав', 'Брест','+375292022377');
INSERT into ДЕТАЛИ(ID_детали,Название_детали,Количество_на_складе,Артикул,Цена,Код_поставщика)
	values	(11, 'Двигатель',150,'dv111',144,111),
			(12, 'Двигатель',180,'dv111',180,222),
			(13, 'Тормозные_диски',190,'dv111',200,222),
			(14, 'Аккумулятор',300,'dv111',220,111),
			(15, 'Аккумулятор',100,'dv111',320,222);

INSERT into ЗАКАЗЫ(Номер_заказа,ID_детали,Количество_заказанных_деталей,Дата_заказа,Примечание)
	values	(1,11,5,'2023-1-9','Самовывоз'),
			(2,12,9,'2023-1-11','Доставка с 14:00 до 18:00'),
			(3,13,10,'2023-1-17','Самовывоз'),
			(4,13,5,'2023-2-9','Доставка с 14:00 до 18:00'),
			(5,15,11,'2023-1-9','Самовывоз'),
			(6,11,9,'2023-1-18','Самовывоз'),
			(7,14,21,'2023-1-24','Доставка с 14:00 до 18:00');


